{$R-}
{$MODE DELPHI}
unit material;

interface
uses gl,  glu,  SysUtils,  sdl, text_glut, glut, glext;
var
	Light_Position : array[0..3] of glFloat = (0.0,15.0,5.0,0.0);
	Ambient_Light : array[0..3] of glFloat = (0.9,0.9,0.9,0.0);
	Diffuse_Light : array[0..3] of glFloat = (1.0,1.0,1.0,1.0);
	Specular_Light : array[0..3] of glFloat = (1.0,1.0,1.0,1.0);
	Shininess:glFloat=0.99*128;
	Emission_Light : array[0..3] of glFloat = (0.0,0.0,0.0,0.0);

//0 Черная пластмасса
//1 Латунь
//2 Бронза
//3 Хром
//4 Медь
//5 Золото
//6 Олово
//7 Серебро
//8 Полированное Cеребро
//9 изумруд
//10 нефрит
//11 обсиден
//12 жемчуг
//13 рубин
//14 бирюза
//15 черный каучук
//16 Полированная бронза
//17 Полированное медь
//18 Полированное золото
//19 Черный пластик
//20 Голубой Пластик
//21 Зеленый Пластик
//22 Красный Пластик
//23 Белый Пластик
//24 Желтый Пластик
//25 Голубая резина
//26 Зеленая резина
//27Красная резина
//28 Белая резина
//29 Желтая резина
	
	Ambient_mat : array[0..29,0..3] of glFloat = ((0.0,0.0,0.0,1.0),(0.329412, 0.223529, 0.027451, 1.0) ,(0.2125,0.1275,0.0540,1.0),(0.2500,0.2500,0.2500,1.0),(0.1913,0.0735,0.0225,1.0),(0.2473,0.1995,0.0745,1.0),(0.1059,0.0588,0.1137,1.0),(0.19225, 0.19225, 0.19225, 1.0),(0.23125, 0.23125, 0.23125, 1.0),(0.0215, 0.1745, 0.0215, 0.55),(0.135, 0.2225, 0.1575, 0.95),(0.05375, 0.05, 0.06625, 0.82),(0.25, 0.20725, 0.20725, 0.922),(0.1745, 0.01175, 0.01175, 0.55),(0.1, 0.18725, 0.1745, 0.8),(0.02, 0.02, 0.02, 1.0),(0.25, 0.148, 0.06475, 1.0),(0.2295, 0.08825, 0.0275, 1.0),(0.24725, 0.2245, 0.0645, 1.0),(0.0, 0.0, 0.0, 1.0),(0.0, 0.1, 0.6, 1.0),(0.0, 0.0, 0.0, 1.0),(0.5, 0.0, 0.0, 1.0),{!!!!!!!!!!!!!!!!!!!!!!!}(0.3, 0.3, 0.3, 1.0),(0.0, 0.0, 0.0, 1.0),	(0.00, 0.05, 0.05, 1.0),(0.00, 0.05, 0.00, 1.0),(0.05, 0.00, 0.00, 1.0),(0.05, 0.05, 0.05, 1.0),(0.05, 0.05, 0.00, 1.0));
	Diffuse_mat : array[0..29,0..3] of glFloat = ((0.0100,0.0100,0.0100,1.0),(0.780392, 0.568627, 0.113725, 1.0) ,(0.7140,0.4284,0.1814,1.0),
	(0.4000,0.4000,0.4000,1.0),(0.7038,0.2705,0.0828,1.0),(0.7516,0.6065,0.2265,1.0),(0.4275,0.4706,0.5412,1.0),(0.50754, 0.50754, 0.50754, 1.0),
	(0.2775, 0.2775, 0.2775, 1.0),(0.07568, 0.61424, 0.07568, 0.55),(0.54, 0.89, 0.63, 0.95),(0.18275, 0.17, 0.22525, 0.82),
	(1.0, 0.829, 0.829, 0.922),(0.61424, 0.04136, 0.04136, 0.55),(0.396, 0.74151, 0.69102, 0.8),(0.01, 0.01, 0.01, 1.0),
	(0.4, 0.2368, 0.1036, 1.0),(0.5508, 0.2118, 0.066, 1.0),(0.34615, 0.3143, 0.0903, 1.0),(0.01, 0.01, 0.01, 1.0),
	(0.0 , 0.50980392 , 0.50980392, 1.0),(0.1 , 0.35 , 0.1, 1.0),(0.5 , 0.0 , 0.0, 1.0),(0.55 , 0.55 , 0.55, 1.0),
	(0.5 , 0.5 , 0.0, 1.0),(0.4, 0.5, 0.5, 1.0),(0.4, 0.5, 0.4, 1.0),(0.5, 0.4, 0.4, 1.0),(0.5 , 0.5 , 0.5, 1.0),(0.5 , 0.5 , 0.4, 1.0));
	Specular_mat : array[0..29,0..3] of glFloat = ((0.5000,0.5000,0.5000,1.0),(0.992157, 0.941176, 0.807843, 1.0) ,(0.3935,0.2719,0.1667,1.0),
	(0.7746,0.7746,0.7746,1.0),(0.2568,0.1376,0.0860,1.0),(0.6283,0.5558,0.3661,1.0),
	(0.3333,0.3333,0.5216,1.0),(0.508273, 0.508273, 0.508273, 1.0) ,(0.773911, 0.773911, 0.773911, 1.0),
	(0.633, 0.727811, 0.633, 0.55),(0.316228, 0.316228, 0.316228, 0.95),(0.332741, 0.328634, 0.346435, 0.82),
	(0.296648, 0.296648, 0.296648, 0.922),(0.727811, 0.626959, 0.626959, 0.55),(0.297254, 0.30829, 0.306678, 0.8),
	(0.4, 0.4, 0.4, 1.0),(0.774597, 0.458561, 0.200621, 1.0),(0.580594, 0.223257, 0.0695701, 1.0),(0.797357, 0.723991, 0.208006, 1.0),
	(0.50, 0.50, 0.50, 1.0),(0.50196, 0.501968, 0.50196, 1.0),(0.45, 0.55, 0.45, 1.0),(0.7, 0.6, 0.6, 1.0),(0.7, 0.7, 0.7, 1.0),
	(0.6, 0.6, 0.5, 1.0),(0.04, 0.7, 0.7, 1.0),(0.04, 0.7, 0.04, 1.0),(0.7, 0.04, 0.04, 1.0),(0.7, 0.7, 0.7, 1.0),(0.7, 0.7, 0.04, 1.0));
	Shininess_mat : array[0..29] of glFloat = (32.0,27.8974,26.0,77.0,13.0,51.0,10.0,51.2,89.6,76.8,12.8,38.4,11.264,76.8,12.8,10.0,76.8,51.2,
	83.2,32.0,32.0,32.0,32.0,32.0,32.0,10.00000,10.00000,10.00000,10.00000,10.00000);

procedure set_material(MATERIAL:GLInt);
procedure set_light_model();
	
implementation
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
procedure set_material(MATERIAL: GLInt);
begin
glLightfv(GL_LIGHT0,GL_DIFFUSE, @Diffuse_mat[MATERIAL]);
glMaterialfv(GL_FRONT_AND_BACK, GL_AMBIENT,@Ambient_mat[MATERIAL]);
glMaterialfv(GL_FRONT_AND_BACK, GL_DIFFUSE,@Diffuse_mat[MATERIAL]);
glMaterialfv(GL_FRONT_AND_BACK, GL_SPECULAR,@Specular_mat[MATERIAL]);
glMaterialfv(GL_FRONT_AND_BACK, GL_SHININESS,@Shininess_mat[MATERIAL]);	
end;

procedure set_light_model();
begin
	glEnable(GL_NORMALIZE);
	glLightfv(GL_LIGHT0,GL_AMBIENT, @Ambient_Light);
	glLightfv(GL_LIGHT0,GL_DIFFUSE, @Diffuse_Light);
	glLightfv(GL_LIGHT0,GL_SPECULAR, @Specular_Light);
	glLightfv(GL_LIGHT0,GL_POSITION,@Light_Position);
	glLightModelfv(GL_LIGHT_MODEL_AMBIENT,@Ambient_Light);
	glLightModeli(GL_LIGHT_MODEL_TWO_SIDE,GL_TRUE);
	glLightModeli(GL_LIGHT_MODEL_LOCAL_VIEWER,GL_TRUE);
	glLightModeli(GL_LIGHT_MODEL_COLOR_CONTROL,GL_SEPARATE_SPECULAR_COLOR);
	glEnable(GL_LIGHT0);
	//glEnable(GL_LIGHTING);
end;

end.

